import 'package:flutter/material.dart';


///
/// 에셋 경로
///
const GUIDELINE_PATH = "assets/documents/guideline_2023.pdf";
const AFFILEXPLAIN_PATH = "assets/documents/brochure_2018.pdf";

const MASCOT_PATH = "assets/images/mascot.png";


///
/// 색깔
///

// 기본 배경 색상
BoxDecoration Background = new BoxDecoration(
    gradient: LinearGradient(colors: [
      Colors.indigo.shade700,
      Colors.blue.shade700,
      Colors.blue,
      Colors.lightBlue.shade400
    ], begin: Alignment.topLeft, end: Alignment.bottomRight));


///
/// 모집요강
///

// pdf에서 이동할 페이지
List<int> page_list = [31, 33, 35, 37, 39, 41, 46, 47];
Map<int, String> page2name = {
  31: "주요 변경사항",
  33: "수시 모집인원",
  35: "논술",
  37: "학생부위주 (교과)",
  39: "학교생활기록부\n반영 방법",
  41: "학생부위주 (종합)",
  46: "조기취업형 계약학과",
  47: "실기위주"
};

// pdf 경로
String GuLi_pdf_path = "";


///
/// 학과 설명
///
String AfEx_pdf_path = "";


///
/// 화면의 가로와 세로
///
double? SCREEN_WIDTH;
double? SCREEN_HEIGHT;

// 가져오기
void getSize(double W, H) {
  SCREEN_WIDTH = W;
  SCREEN_HEIGHT = H;
}


///
/// 성적
///

// 상대 등급 -> 점수
final Map<String, double> changed1 = {
  '1':  100,  '2': 99.5,  '3':   99,
  '4': 98.5,  '5':   98,  '6': 97.5,
  '7':   85,  '8':   60,  '9':   30
};

// 절대 등급 -> 점수
final Map<String, double> changed2 = {"A": 100, "B": 99.5, "C": 98};


///
/// 모집인원표
///

// 수시 입학 전형
final List<String> recruit_column = [
  "논술", "학생부우수자", "지역균형", "농어촌(교과)", "가천의약학",
  "가천바람개비", "가천AI/SW", "농어촌(종합)", "특성화고교", "교육기회균형",
  "특성화고졸재직자", "실기우수자", "조기취업형계약학과"
];

// 수시 입학 학과와 전형별 인원
final List<List<dynamic>> recruit_data = [
  ["인문", "경영학부", 91, 46, 25, 2, 0, 50, 0, 3, 5, 0, 90, 0, 0],
  ["자연", "빅데이터경영학과", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "금융수학과", 14, 6, 6, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
  ["인문", "미디어커뮤니케이션학과", 13, 7, 6, 2, 0, 11, 0, 2, 2, 0, 0, 0, 0],
  ["인문", "관광경영학과", 11, 6, 6, 2, 0, 8, 0, 1, 2, 0, 0, 0, 0],
  ["인문", "경제학과", 26, 10, 8, 2, 0, 15, 0, 2, 2, 0, 0, 0, 0],
  ["인문", "의료산업경영학과", 13, 6, 6, 2, 0, 6, 0, 0, 2, 0, 0, 0, 0],
  ["인문", "응용통계학과", 13, 6, 6, 2, 0, 7, 0, 1, 0, 0, 0, 0, 0],
  ["인문", "사회복지학과", 11, 6, 6, 2, 0, 9, 0, 1, 2, 0, 0, 0, 0],
  ["인문", "유아교육학과", 15, 6, 6, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0],
  ["인문", "심리학과", 10, 6, 6, 2, 0, 8, 0, 2, 0, 0, 0, 0, 0],
  ["인문", "패션산업학과", 8, 6, 5, 2, 0, 6, 0, 2, 3, 0, 0, 0, 0],
  ["인문", "한국어문학과", 11, 6, 6, 2, 0, 8, 0, 1, 0, 0, 0, 0, 0],
  ["인문", "외국어계열", 61, 25, 24, 6, 0, 30, 0, 4, 0, 0, 0, 0, 0],
  ["인문", "법학과", 22, 9, 9, 3, 0, 11, 0, 2, 0, 0, 0, 0, 0],
  ["인문", "경찰행정학과", 10, 6, 6, 2, 0, 9, 0, 2, 0, 0, 0, 0, 0],
  ["인문", "행정학과", 10, 6, 7, 2, 0, 7, 0, 1, 2, 0, 0, 0, 0],
  ["인문", "자유전공학부", 20, 11, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "도시계획조경학부", 20, 10, 7, 0, 0, 7, 0, 2, 1, 0, 0, 0, 0],
  ["자연", "건축학부", 30, 14, 10, 3, 0, 11, 0, 2, 3, 0, 0, 0, 0],
  ["자연", "설비/소방공학과", 18, 10, 7, 2, 0, 8, 0, 1, 2, 0, 0, 0, 0],
  ["자연", "화공생명공학전공", 23, 13, 8, 2, 0, 16, 0, 2, 2, 0, 0, 0, 0],
  ["자연", "베터리공학전공", 11, 7, 6, 0, 0, 6, 0, 0, 2, 0, 0, 0, 0],
  ["자연", "기계공학전공", 21, 12, 8, 2, 0, 16, 0, 2, 3, 0, 0, 0, 0],
  ["자연", "산업공학전공", 12, 7, 5, 2, 0, 6, 0, 0, 2, 0, 0, 0, 0],
  ["자연", "스마트팩토리전공", 12, 7, 5, 0, 0, 6, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "토목환경공학과", 13, 7, 5, 0, 0, 6, 0, 0, 2, 0, 0, 0, 0],
  ["자연", "신소재공학과", 13, 7, 5, 2, 0, 6, 0, 2, 2, 0, 0, 0, 0],
  ["자연", "식품생명공학과", 14, 7, 5, 2, 0, 6, 0, 0, 2, 0, 0, 0, 0],
  ["자연", "식품영양학과", 13, 7, 6, 2, 0, 6, 0, 2, 2, 0, 0, 0, 0],
  ["자연", "바이오나노학과", 13, 7, 6, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "생명과학과", 13, 6, 6, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
  ["자연", "물리학과", 12, 6, 6, 2, 0, 7, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "화학과", 12, 6, 6, 2, 0, 7, 0, 2, 0, 0, 0, 0, 0],
  ["자연", "소프트웨어전공", 21, 13, 8, 2, 0, 0, 20, 1, 0, 0, 0, 0, 0],
  ["자연", "인공지능전공", 35, 16, 15, 2, 0, 0, 30, 2, 0, 0, 0, 0, 0],
  ["자연", "컴퓨터공학전공", 35, 18, 15, 2, 0, 22, 0, 2, 5, 0, 90, 0, 0],
  ["자연", "스마트보안전공", 13, 6, 6, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "전자공학과", 30, 16, 13, 2, 0, 18, 0, 2, 3, 0, 0, 0, 0],
  ["자연", "시스템반도체전공", 12, 6, 6, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "차세대반도체설계전공", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "전기공학과", 22, 9, 7, 2, 0, 10, 0, 2, 3, 0, 0, 0, 0],
  ["자연", "스마트시티융합학과", 12, 6, 5, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "의공학과", 12, 6, 5, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
  ["자연", "간호학과", 83, 42, 20, 3, 0, 45, 0, 2, 2, 0, 0, 0, 0],
  ["자연", "바이오로직스학과", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "치위생학과", 9, 5, 5, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
  ["자연", "방사선학과", 10, 5, 5, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
  ["자연", "물리치료학과", 10, 5, 5, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
  ["자연", "응급구조학과", 6, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "운동재활학과", 10, 5, 5, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "의예과", 0, 5, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "한의예과", 0, 5, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0],
  ["자연", "약학과", 0, 3, 0, 1, 12, 0, 0, 0, 0, 3, 0, 0, 0],
  ["예체능", "회화/조소전공", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 0],
  ["예체능", "디자인전공", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 0],
  ["예체능", "성악전공", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0],
  ["예체능", "기악전공", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 31, 0],
  ["예체능", "작곡전공", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0],
  ["예체능", "체육전공", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 0],
  ["예체능", "태권도전공", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 0],
  ["예체능", "연기예술학과", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 0],
  ["자연", "바이오의료기기학과", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40],
  ["자연", "게임영상학과", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 60],
  ["자연", "미래자동차학과", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40],
  ["자연", "반도체디스플레이학과", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50],
  ["자연", "반도체설계학과", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50]
];